# SupportsOverrides Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PointCloudInstance..::..SupportsOverrides Property
PointCloudInstance Class See Also
---
Identifies whether the instance can have graphic overrides.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool SupportsOverrides { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SupportsOverrides As Boolean
	Get
```

Visual C++
---
```text
public:
property bool SupportsOverrides {
	bool get ();
}
```

# See Also
PointCloudInstance Class
Autodesk.Revit.DB Namespace